<b> Manual Python </b> 

Autor: Marcio Jonavicius Rodrigues

In [7]:
# conda install numpy
# pid install numpy
import pandas as pd 
import numpy as np

Imporat e export

In [3]:
## Tipos de import 
cand_doacoes = pd.read_csv("risco_credito.csv",sep=';',encoding = 'latin_1', decimal = ",")
#forçe a abertura para visualizar os dados 
data = pd.read_csv('Dados_Credito_teste.csv',  error_bad_lines=False
# separador
data = pd.read_csv('Dados_Credito_teste.csv',  sep= ";")

In [4]:
# File txt
file =open('D:\curso\investimento\historico\B3SA3.txt', "r")
file.read()

In [9]:
# Excel export
df.to_excel('Exemplo_Excel.xlsx',sheet_name='Sheet1')

Criar base

In [11]:
#Cria dataset
df = pd.DataFrame({"a": [1,2,3,4,5], "b": [2,3,4,5,6]})

## concatenação de bases

In [14]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [15]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [16]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [18]:
pd.concat([df1,df2])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [22]:
# contatenação lateral (no exemplo os indices são diferente por isso criou varias linhas
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

## left join, inner

In [30]:
esquerda = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K3'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
direita = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [31]:
esquerda

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K3   K1  A3  B3

In [32]:
direita

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [33]:
pd.merge(esquerda,direita,how='left',on='key1')

  key1 key2_x   A   B key2_y    C    D
0   K0     K0  A0  B0     K0   C0   D0
1   K0     K1  A1  B1     K0   C0   D0
2   K1     K0  A2  B2     K0   C1   D1
3   K1     K0  A2  B2     K0   C2   D2
4   K3     K1  A3  B3    NaN  NaN  NaN

In [34]:
pd.merge(esquerda,direita,how='inner',on='key1')

  key1 key2_x   A   B key2_y   C   D
0   K0     K0  A0  B0     K0  C0  D0
1   K0     K1  A1  B1     K0  C0  D0
2   K1     K0  A2  B2     K0  C1  D1
3   K1     K0  A2  B2     K0  C2  D2

In [36]:
#junta dados semelhantes (Pela chave) 
pd.merge(esquerda, direita, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [37]:
# outer 
pd.merge(esquerda, direita, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K3   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [38]:
# right
pd.merge(esquerda, direita, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [39]:
# left
pd.merge(esquerda, direita, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K3   K1  A3  B3  NaN  NaN

###### juntar
#Juntar é um método conveniente para combinar as colunas de dois DataFrames indexados potencialmente diferentes em um único resultado DataFrame.

In [43]:
esquerda = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

direita = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

esquerda

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [44]:
direita

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [42]:
esquerda.join(direita)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

## Duplicados

In [88]:
df = pd.DataFrame({'col1':[1,2,3,4,5],'col2':[444,555,666,444, np.nan ],'col3':['abc','def','ghi','xyz','']})
df.head()

   col1   col2 col3
0     1  444.0  abc
1     2  555.0  def
2     3  666.0  ghi
3     4  444.0  xyz
4     5    NaN

In [49]:
# unique da lib pandas

df_dup=df['col2'].unique()

df_dup

array([444, 555, 666], dtype=int64)

In [52]:
# unique lib numpy 
np.unique(df['col2'])

array([444, 555, 666], dtype=int64)

In [54]:
# conta os dados unicos 
len(df['col2'].unique())

3

In [55]:
#outro método
df['col2'].nunique()

3

## Agrupamento

In [81]:
# agrupa e mostra quantas vezes o dado aparece 
df['col2'].value_counts()

444.0    2
666.0    1
555.0    1
Name: col2, dtype: int64

In [82]:
#Descendente
df['col2'].value_counts(ascending=True)

555.0    1
666.0    1
444.0    2
Name: col2, dtype: int64

In [83]:
#Mantem os dados missing
df['col2'].value_counts(dropna=False)

444.0    2
NaN      1
666.0    1
555.0    1
Name: col2, dtype: int64

In [89]:
# value_counts() to bin continuous data into discrete intervals (cria grupos) 
# cria 2 grupos 
df_5=df['col2'].value_counts(bins=2)

In [90]:
df_5

(443.77700000000004, 555.0]    3
(555.0, 666.0]                 1
Name: col2, dtype: int64

## Preencher missing

In [91]:
df_4=df.fillna('', inplace=True)

In [94]:
df.isnull().sum()

col1    0
col2    0
col3    0
dtype: int64

In [95]:
df.notnull().sum()

col1    5
col2    5
col3    5
dtype: int64

In [ ]:
## filtro - selecionar dados

In [96]:
# Selecione do DataFrame usando critérios de várias colunas
newdf = df[(df['col1']>2) & (df['col2']==444)]

newdf

   col1 col2 col3
3     4  444  xyz

In [ ]:

################# Ordenando um DataFrame

df.sort_values(by='col2') #inplace=False por padrão

df.sort_values(by='col2', inplace=True) #inplace=False por padrão


############### Macros ou funções

# cria a função 
def times2(x):
    return x*2

#aplica a função
df['col1'].apply(times2)

#aplica funções já prontas
df['col3'].apply(len)
 df['col1'].sum()


############### Removendo columa permanentemente
del df['col1']

############### Obter nomes de coluna e índice

df.columns
df.index


############# Pivot table - tabel dinamica


data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

df.pivot_table(values='D',index=['A', 'B'],columns=['C'])


########## in and Not in 

df = pd.DataFrame({'countries':['US','UK','Germany','China']})
sele = ['UK','China']

#in
df[df.countries.isin(countries)]

# not in 
df[~df.countries.isin(countries)]

https://docs.python.org/3/howto/sorting.html